[
    {
        "id": "1",
        "descripcion": "El proyecto es realizado para Mundo Donas, un negocio enfocado en la venta de donas en la provincia de Mendoza, Argentina. Es una Landing page que permite realizar scroll en su página principal y, al seleccionar una categoría, se dirige a la ruta de dicha categoría para visualizar los productos. La base de datos utilizada es de Firebase y se utilizaron los estilos y colores de la marca.",
        "description": "The project is developed for Mundo Donas, a business focused on selling donuts in the province of Mendoza, Argentina. It is a landing page that allows users to scroll through the main page and, upon selecting a category, navigates to the category's route to view the products. The Firebase database is used, and the styles and colors of the brand are incorporated.",
        "tecnologias": "El proyecto se creó utilizando React.js, React DOM y React Router DOM . Para agregar animaciones de desplazamiento suaves a los elementos de la página se utilizó React Scroll. Para la base de datos se generó utilizando Firebase, y se utilizó Firestore para una sincronización en tiempo real. Para los estilos, se utilizó Tailwind CSS , proporcionando un diseño responsivo y una personalización avanzada del diseño de la aplicación. En cuanto a las herramientas de desarrollo, se empleó @vitejs/plugin-react versión 4.2.0 para integrar React con Vite.",
        "technologies": "The project was created using React.js, React DOM, and React Router DOM. React Scroll was used to add smooth scroll animations to the page elements. Firebase was used for the database, and Firestore was utilized for real-time synchronization. Tailwind CSS was used for styling, providing a responsive design and advanced customization of the application's layout. Regarding development tools, @vitejs/plugin-react version 4.2.0 was employed to integrate React with Vite",
        "nombre": "Landing page React js",
        "titulo": "Mundo Donas",
        "url": "https://mundo-donas-abel.vercel.app/",
        "video": "https://firebasestorage.googleapis.com/v0/b/porfolio-73b6e.appspot.com/o/videos%2FmundoDonas.mp4?alt=media&token=30d7d1f8-6dab-4034-a4b1-abb68f26e7b9"
    },
    {
        "id": "2",
        "descripcion": "El proyecto es realizado para un e-commerce que se dedica a la venta de guitarras y, en el cual se pueden visualizar 18 productos de distintas categorías, que son importadas desde una base de datos de Firebase. La aplicación permite realizar filtros, utilizando rutas, por categoría en relación al sonido de las guitarras, por menor o mayor precio y además por los 6 productos más vendidos. El proyecto permite visualizar el detalle de cada producto, seleccionar cantidades y agregar al carrito, cuando eso sucede se actualiza la cantidad en stock en la base de datos en firebase, reservando dicho producto. En la sección de carrito se pueden seguir añadiendo o quitando cantidades de productos, en caso de eliminarlo el stock se recupera en la base de datos. Al realizar el pedido se genera el comprobante de pedido y se lo suministra al cliente.",
        "description": "The project is designed for an e-commerce business that sells guitars, showcasing 18 products from various categories imported from a Firebase database. The application allows filtering by category based on the sound of the guitars, by price (low to high or high to low), and by the top 6 best-selling products. Users can view detailed information for each product, select quantities, and add items to the cart. When a product is added to the cart, the stock quantity in the Firebase database is updated to reserve the product. In the cart section, users can continue adding or removing product quantities. If a product is removed, the stock is restored in the database. When an order is placed, an order receipt is generated and provided to the customer.",
        "tecnologias": "El proyecto se creo utilizando react version 18.2.0, react-dom versión 18.2.0 y react-router-dom versión 6.15.0. La base de datos se generó utilizando Firebase versión 10.3.1. Para los estilos se utilizo sass y el framework CSS tailwind. Para las notificaciones de comunicación con el usuario se utilizó sonner toast.",
        "technologies": "The project was created using React version 18.2.0, React DOM version 18.2.0, and React Router DOM version 6.15.0. The database was generated using Firebase version 10.3.1. For styling, SASS and the Tailwind CSS framework were used. For user communication notifications, Sonner Toast was used..",
        "nombre": "E-commerce React js",
        "titulo": "SoloGuitarras",
        "url": "https://abel-pierobon-entrega-final-pierobon.vercel.app/",
        "video": "https://firebasestorage.googleapis.com/v0/b/porfolio-73b6e.appspot.com/o/videos%2FV%C3%ADdeo%20sin%20t%C3%ADtulo%20%E2%80%90%20Hecho%20con%20Clipchamp.mp4?alt=media&token=0252594e-12fc-4a31-80c0-48908ad4ac7c"
    },
    {
        "id": "3",
        "descripcion": "La aplicación fue diseñada para manejar turnos y llamados en una entidad pública. Al iniciar sesión, se pueden cargar turnos y llamar los mismos, mientras en la pantalla principal se visualizan los llamados. Los turnos y llamados son almacenados en una base de datos en Firebase.",
        "description": "The application was designed to manage shifts and calls in a public entity. Upon logging in, users can load shifts and make calls, while the main screen displays the calls. Shifts and calls are stored in a Firebase database.",
        "tecnologias": "El proyecto se creó utilizando React.js, React DOM y React Router DOM. La base de datos se generó utilizando Firebase y se utilizó Firestore para la gestación en tiempo real y funcionalidades de autenticación.Para los estilos se utilizó Tailwind CSS. El entorno de desarrollo está gestionado por React Scripts.Para los estilos y notificaciones, se utilizó Sonner y SweetAlert2.", 
        "technologies": "The project was created using React.js, React DOM, and React Router DOM. The database was generated using Firebase, and Firestore was used for real-time management and authentication functionalities. Tailwind CSS was used for styling. The development environment is managed by React Scripts. For styling and notifications, Sonner and SweetAlert2 were used.",
        "nombre": "Turnero React-js",
        "titulo": "Turnero",
        "url": "https://turnero-reactjs.vercel.app/",
        "video": "https://firebasestorage.googleapis.com/v0/b/porfolio-73b6e.appspot.com/o/videos%2FTurnero.mp4?alt=media&token=9779d051-d9bc-4410-a97f-170e78bfb2e1"
    },
    {
        "id": "4",
        "descripcion": "Bartender es una aplicación de React Native construida con Expo, diseñada para gestionar,buscar y mostrar los procesos de preparación de bebidas y, permite guardar en favoritos, las bebidas preferidas del usuario. Además permite, crear, actualizar y eliminar preparaciones propias de cada usuario y, publicarlas en las bebidas de la comunidad para asi, poder ser vistas por otros usuarios. ",
        "description": "Bartender is a React Native application built with Expo, designed to manage, search for, and display the preparation processes of drinks. It allows users to save their favorite drinks. Additionally, users can create, update, and delete their own drink preparations and publish them in the community drinks section to be viewed by other users.",
        "tecnologias": "La aplicación utiliza varias bibliotecas como React Navigation para la navegación, Redux Toolkit para la gestión del estado y Axios para las llamadas API. También incluye características como selección de imágenes, integración de base de datos SQLite y personalización de la barra de estado.",
        "technologies":"The application uses several libraries such as React Navigation for navigation, Redux Toolkit for state management, and Axios for API calls. It also includes features like image selection, SQLite database integration, and status bar customization.",
        "nombre": "App React Native",
        "titulo": "AppDrinks",
        "url": "https://drive.google.com/file/d/1g7nOU3kMHZu2pdhUEZpX42buMm10O2K8/view?usp=sharing",
        "video": "https://firebasestorage.googleapis.com/v0/b/porfolio-73b6e.appspot.com/o/videos%2Fapp.mp4?alt=media&token=cdaff8a3-ed09-41b9-9a8c-8978400c823a"
    }
]
