{
    "presentacion": {
        "title": "I am Abel Pierobon",
        "subtitle": "Front-end Developer",
        "span": "Data Scientist",
        "edad": "I am 37 years old.",
        "description": "I live in Córdoba Capital, Argentina."
    },
    "about": {
        "description": "I am a self-taught and enthusiastic Front-End Developer and Data Scientist. I have training in React JS, React Native, Vue JS, Data Science, and Data Analytics. I am passionate about creating dynamic and interactive web applications, using the best web development practices and leveraging the power of data.",
        "description1": "As a Front-End Developer, I have expertise in HTML, CSS, and JavaScript, which are fundamental technologies for creating and styling web pages. I am proficient in frameworks and libraries such as React JS, React Native, and Vue JS, allowing me to build responsive and interactive user interfaces. I also use Bootstrap and Tailwind CSS to create responsive and mobile-first designs. My skills include SASS for advanced styling, AJAX for asynchronous web requests, and GIT for version control.",
        "description2": "In Data Science, I am skilled in Python, a versatile programming language used extensively in this field. I work with libraries like Pandas and NumPy for data manipulation and numerical computations, and Seaborn for data visualization. My expertise extends to SQL for database management and querying, and I am knowledgeable in machine learning techniques and algorithms for building predictive models and analyzing data.",
        "description3": "I have participated in various personal and professional projects where I have applied these skills to deliver impactful and efficient solutions."
    },
    "barra": {
        "home": "Home",
        "certificaciones": "Certificates",
        "proyectos": "Projects",
        "contacto": "Contact"
    },
    "sobreMi": {
        "descripcion": " Soy un Desarrollador Front-End y Científico de Datos autodidacta y entusiasta. Tengo formación en React JS, React Native, Vue JS, Ciencia de Datos y Análisis de Datos. Me apasiona crear aplicaciones web dinámicas e interactivas, utilizando las mejores prácticas del desarrollo web y aprovechando el poder de los datos.",
        "descripcion1": " Como Desarrollador Front-End, tengo experiencia en HTML, CSS y JavaScript, que son tecnologías fundamentales parala creación y el diseño de páginas web. Soy competente en frameworks y bibliotecas como React JS, React Native y Vue JS, lo que me permite construir interfaces de usuario responsivas e interactivas. También utilizo Bootstrap y Tailwind CSS para crear diseños responsivos y móviles. Mis habilidades incluyen SASS para estilos avanzados, AJAX para solicitudes web asincrónicas y GIT para control de versiones.",
        "descripcion2": "En Ciencia de Datos, tengo habilidades en Python, un lenguaje de programación versátil utilizado ampliamente en este campo. Trabajo con bibliotecas como Pandas y NumPy para la manipulación de datos y cálculos numéricos, y Seaborn para la visualización de datos. Mi experiencia se extiende a SQL para la gestión y consulta de bases de datos, y tengo conocimientos en técnicas y algoritmos de aprendizaje automático para construir modelos predictivos y analizar datos.",
        "descripcion3": "He participado en diversos proyectos personales y profesionales donde he aplicado estas habilidades para ofrecer soluciones impactantes y eficientes."
    }
}
